# ImportOptions3DM Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImportOptions3DM Constructor
ImportOptions3DM Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ImportOptions3DM()()()() | Constructs a new instance of ImportOptions3DM with default values of all properties. |
| ImportOptions3DM(ImportOptions3DM) | Constructs a new instance of ImportOptions3DM as a copy of the provided import options. |

# See Also
ImportOptions3DM Class
ImportOptions3DM Members
Autodesk.Revit.DB Namespace